---
kind: property
id: P:Autodesk.Revit.DB.Visual.Gradient.GradientType
source: html/cc647334-e225-cd19-0656-c1b1c8957e07.htm
---
# Autodesk.Revit.DB.Visual.Gradient.GradientType Property

The property labeled "Gradient Type" from the "Gradient" schema.

## Syntax (C#)
```csharp
public static string GradientType { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "GradientType".